app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)