app/controllers/lps_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_artist
      @artist = Artist.find(params[:artist_id])